from unicodedata import *
from easyclassfy import Model

badwords=[
    'sex', 'your mom', '늑음마', '느금', '느그마', '느금마', '시발', 'ㅈㄴ',
    '좆나', '존나', '좋나', '암컷타락', '딸친다', '딸치', '딸딸이', '노알라',
    '노짱', '그립습니다', '놎장', '노무현', 'mc무현', '이명박근혜', '이재명',
    'no무현', 'MC무현', 'MC발년', '박원순', '무현짱', '노무노무', '노무',
    '그립습니노', '보지', 'bozi', '개보지', '노애미', '헤응', '하앙', '뷰릇',
    '보추', '성기훈', '성기', '니앰창', '엠창', '니 amy', '니ami', '비응신',
    'be응신', '븅', '뷰웅신', '병신', '시봘', '감인', '개샊', '씹샊', '개색히', '십색히', '꼬추', '개보지',
    'ㅄ','ㅂㅅ', 'ㅂㅊ', '폰섹', '섹스', '정액', '섻', 'cex',  '아항', '헤으응', '가버렷', '가버렸', '박아줘',
    '앙', '흐응', '뷰르릇', '뷰룻', '부룻', '불알', '부랄', '히토미', '코알라무현','mc재명', '재명이', '재명',
    '재명이네마을', '민생지원금', '시진핑', '짱깨', '장깨', '짱개', '야스','곶', '6974', '69', '질싸', '쌌다',
    '콘돔', '형수보지', '형보수지', '봊이', '뷰지', '쥬지', '이승만', '윤석열', '박근혜', '박정희', 'suicide',
    '성남시장', '쎅스', '석스', '세엑스', '섹쓰', '야아스', '븆이', 'ㅅ달티다', '즌나', '종나', 'ㅅl발', 'ㅅ발',
    'ㅅㅔㄱ', '서ㅣㄱ', '세ㄳ', '색스', '사ㅣㄱ스', '샋으', '갮', 'sexual', 'sexer','병', '염병', '찢재명',
    '찟재명','찢찢', '드럼통',' 드럼통아저씨', '드럼통령','드럼통대통령', '빨간당','파란당','붉은당','푸른당','빨강파랑주황'
    ,'개혁신당','국힘','국민의힘','민주당','더불어민주당','죄명이','이죄명','윤건희','김건희','윤석열','석여리','석열이','서결이',
    '윤서결','김석열', '석열','kim건희','kimgunhee','건희김','킴건희','노무알라','찢칠라','잼칠라','찟칠라','탄핵','ㅗ','새끼','샛키',
    '새기','쌔끼','색히','새기','샊', '뻨','뻐커','퍼커','퍼ㅓ커','fucker','fuker','fucer','fuck','fuXX','시X', '니네엄마',
    '니네아빠','써겨리','니아빠','느그아빠','seex','섹슈얼','창년','상년','쌍년','썅년','박찬대','형수욕','김현지','현지누나'
]

whitelist=['보지마', '보지말아', '보지 마', '섹션', '시발자동차', '시발 자동차', '시발차', '어ㅄ', '익', '병따개', '병딱애',
           '병앓이', '병아리','병을 앓다', '병기', '김병', '이병철', '병사', '병렬', '병균', '징병', '모병', '병준',
           '조병갑', '조병식', '김병진', '김병재', '박두병', '권오병', '병원', '병원균', '질병', '재발병', '발병','병역',
           '화병', '수병', '전염병', '성기사', '작성기', '형성기', '보지도못', '보지못한', '보지않은','보지않', '잘보지',
           '가보지', '해보지', '못보지', '보지도않','ㅗ먹어','병진','오ㅗ스','ᇪ','최재명','박건희','이건희','beach','정신병',
           '병자호란','병오년','나병','간질병','병석','병규','홧병','이병헌','병현','병환','병길','지병','병조림','소주병',
           '맥주병','도성기', '삼성기', '성기운', '성기훈', '확성기', '계측기', '발생기', '수신기', '변성기','보지못해', '보지말라고',
           '보지않을까', '보지못함', '보지않아', '보지않게', '보지마세요', '보지도', '보지말자', '보지않는']

aibadwords=['크시야 박을게', '크시야 삽입', '크시야 앙', '크시야 헤응', '아흐응.. 아흣! 헤응, 아항아항', 'F컵', '야스하고싶다'
            , 'ㅅㅂ 니가 한거잖아', '이거 ㅈㄴ 이상해서 작동 안할걸', '딸치러 간다','ㅅ달티러','뷰릇뷰릇 뷰르릇', '건희와 석열이',
            '건희와 써겨리', '윤건희와 김석열', '이거 걍 재명이 급인데', '응디응디', '운지뛰고싶다', '부엉이바위 운지해서 떨어',
            '확 올라갔다가 확 내려갔다가', '게이야','곧휴', '병신아 그게 아니라 이건','좆까','조까','시발','씨이발','개새끼', '꼬추','섹스','sex',
            'bitch','fuck','빡큐','ㅗ','보지','자지','뻑유','fuke',':middle_finger:','🤏','🖕','ㄴ애미 조두순', '느개비','느급마','빠악큐', '갯액키',
            '개ski','개년','씹할년','씹할련', '니거','니이거','nigger','N word','닉어', '두순이','섻','쌕스']

aiwhitewords=['박재준','박재현','박수진','박준규','박홍민','박민지','박지명','박정흠','박석흠', '김석민', '김석규', '김석환',
              '리코더 운지법','리코더 운지', '디스크 삽입해서 해볼래요','삽입이 안되는 거 같은데', '게임','게임기', '이건희 회장',
              '박건희','재명이','병진이','조병준', '조형준','재준이','웅?','응응', '김응준','개좋다','마이너','곧 휴식시간입니다',
              '김병식','조병식','딸 낳았대요','그러니까 걔가 그 사람 딸이라고?','주식이 계속 확확 바뀌어서 정신이 없어요', '올라가는거 따라가면 내려가는걸 못따라가고',
              '뛰기 좋은 장소 추천 부탁','앙기모찌','그걸 컵에 따라 먹어야지', '빡치네','빡친다','보지마라','자지마라','고추 따러 갔다옴','이거','이거 레전드임',
              '이거 개좋음','윤석훈','윤지후','김병지', '키보드가 뻑뻑하네', '부엉이 봤음?', '시발차','시발자동차','Faker','fine','furry', '섹션화','beach',
              '아가','니가 했잖아', '너가했잖아', '니가 나가세요', '운전면허','운전시험','행운', '행운의 아이템','고추장','고춧가루','고추까루','고추자ㅏㅇ','비행기',
              '조심해','이가탄','이미지 삽입','안녕하세요','반가워요','사랑해요','ㄹㅈㄷ다',]

ignore=['1', '2', '!', '@', ';','.', '/','#','~',',','|', 'l','ㅣ', '3','9','0','5','-','_',
        '^', '&', '*', '(', ')', '+', '=', '?', '`', '\'', '"', '{', '}', '[', ']', '<', '>', '…', '·']

m=Model()
m.add_data(aibadwords,1)
m.add_data(aiwhitewords,0)
m.train()


def cutting(word):
    wire=word.lower()
    is_bad=None
    for char in ignore:
        word=word.replace(char, '')
        word=word.replace(' ','')
        wire=wire.replace(char, '')

    word=word.replace('rl','ㅐ')
    word=word.replace('_ㅣ_', 'ㅗ')
    word=word.replace('_|_', 'ㅗ')
    word=word.replace('_l_', 'ㅗ')
    word=word.replace('H','ㅐ')
    word=word.replace('no','노')

    wire = wire.replace('rl', 'ㅐ')
    wire = wire.replace('_ㅣ_', 'ㅗ')
    wire = wire.replace('_|_', 'ㅗ')
    wire = wire.replace('_l_', 'ㅗ')
    wire = wire.replace('H', 'ㅐ')
    wire = wire.replace('no', '노')

    for char in whitelist:
        word=word.replace(char, '')

    word=normalize('NFD',word)

    for char in badwords:
        spli=normalize('NFD',char)
        if spli in word:
            is_bad=True
            break
        else:
            is_bad=False
    if is_bad==False:
        if m.classify(wire)==1:
            is_bad=True
        else:
            is_bad=False
    return is_bad
